let errcode = [{
  "errCode": "301",
  "errName": "风机控制反馈错误",
  "errSolution": "1、请检查PLC硬件输出是否正常；2、继电器吸合是否正常；3、风机低压控制柜供电是否正常"
}, {
  "errCode": "302",
  "errName": "设备A、B、C三相电流数据均为0，但控制器反馈设备运行",
  "errSolution": "1、风机主供电电缆异常；2、风机本地开关柜跳闸；3、低压柜电流互感器异常"
}, {
  "errCode": "303",
  "errName": "设备供电缺相",
  "errSolution": "请停止风机，查看详细电流数据；排查建议：1、查看电流互感器及电力采集终端工作情况；2、前往风机本地控制箱查看供电线路"
}, {
  "errCode": "304",
  "errName": "设备A、B、C三相至少有1相电流有数据，但控制器反馈设备未运行",
  "errSolution": "1、交流接触器辅助触点故障；2、电流互感器故障；3、风机线路有漏电现象"
}, {
  "errCode": "305",
  "errName": "风机A、B、C三相电流至少有一路超过正常范围",
  "errSolution": "1、风机机械故障或短路，请迅速停止风机"
}, {
  "errCode": "308",
  "errName": "照明控制反馈错误",
  "errSolution": "1、请检查PLC硬件输出是否正常；2、继电器吸合是否正常；3、照明控制柜供电是否正常"
}, {
  "errCode": "3081",
  "errName": "照明单相电流超过正常范围",
  "errSolution": "1、照明线路出现短路或漏电，请迅速关闭该路照明"
}, {
  "errCode": "312",
  "errName": "照明单相电流为0, 反馈运行",
  "errSolution": "1、照明主供电电缆异常；2、照明本地开关柜跳闸；3、电流互感器线路异常"
}, {
  "errCode": "3121",
  "errName": "照明单相电流不为0,反馈停止",
  "errSolution": "1、接触器辅助触点损坏；2、PLC输入接口损坏；3、反馈线路故障；4、现场有漏电情况"
}, {
  "errCode": "320",
  "errName": "CO数据为0",
  "errSolution": "1、传感器断电或损坏；2、模拟量信号电缆损坏；3、PLC模拟量模块损坏。排查建议：断开PLC控制柜模拟量接线端子，用万用表直流电流挡位测量端子电流，正常范围为4-20mA，否则可判断为传感器或模拟量信号线损坏。"
}, {
  "errCode": "3201",
  "errName": "VI数据为0",
  "errSolution": "1、传感器断电或损坏；2、模拟量信号电缆损坏；3、PLC模拟量模块损坏。排查建议：断开PLC控制柜模拟量接线端子，用万用表直流电流挡位测量端子电流，正常范围为4-20mA，否则可判断为传感器或模拟量信号线损坏"
}, {
  "errCode": "322",
  "errName": "风速风向数据为0且长时间无变化",
  "errSolution": "1、传感器断电或损坏；2、模拟量信号电缆损坏；3、PLC模拟量模块损坏。排查建议：断开PLC控制柜模拟量接线端子，用万用表直流电流挡位测量端子电流，正常范围为4-20mA，否则可判断为传感器或模拟量信号线损坏"
}, {
  "errCode": "323",
  "errName": "洞内光强数据为0且长时间无变化",
  "errSolution": "1、传感器断电或损坏；2、模拟量信号电缆损坏；3、PLC模拟量模块损坏。排查建议：断开PLC控制柜模拟量接线端子，用万用表直流电流挡位测量端子电流，正常范围为4-20mA，否则可判断为传感器或模拟量信号线损坏"
}, {
  "errCode": "3231",
  "errName": "洞外光强数据为0且长时间无变化",
  "errSolution": "1、传感器断电或损坏；2、模拟量信号电缆损坏；3、PLC模拟量模块损坏。排查建议：断开PLC控制柜模拟量接线端子，用万用表直流电流挡位测量端子电流，正常范围为4-20mA，否则可判断为传感器或模拟量信号线损坏"
}, {
  "errCode": "324",
  "errName": "CO数据异常",
  "errSolution": "1、CO浓度超过允许范围（0-250），请检查检测器数据，适当时应开启风机通风"
}, {
  "errCode": "325",
  "errName": "VI数据异常",
  "errSolution": "1、VI浓度超过允许范围（0-0.012），请检查检测器数据，适当时应开启风机通风"
}, {
  "errCode": "326",
  "errName": "风速风向数据异常",
  "errSolution": "1、风速超过正常范围（0-8），如遇特别天气，请做好安全防范措施；2、若无特别天气，请校准风速风向传感器数据"
}, {
  "errCode": "327",
  "errName": "洞内光强数据异常",
  "errSolution": "1、传感器断电或损坏；2、模拟量信号电缆损坏；3、PLC模拟量模块损坏。排查建议：断开PLC控制柜模拟量接线端子，用万用表直流电流挡位测量端子电流，正常范围为4-20mA，否则可判断为传感器或模拟量信号线损坏电流，正常范围为4-20mA，否则可判断为传感器或模拟量信号线损坏。',"
}, {
  "errCode": "3271",
  "errName": "洞外光强数据异常",
  "errSolution": "1、传感器断电或损坏；2、模拟量信号电缆损坏；3、PLC模拟量模块损坏。排查建议：断开PLC控制柜模拟量接线端子，用万用表直流电流挡位测量端子电流，正常范围为4-20mA，否则可判断为传感器或模拟量信号线损坏"
}, {
  "errCode": "335",
  "errName": "交通控制设备逻辑故障",
  "errSolution": "1、交通控制设备存在控制逻辑错误，请于隧道监控界面中查看隧道设备状态"
}]

let errdict = {}

errcode.map(item => {
  errdict[item.errName] = item.errSolution
})

export default errdict
